; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v6)
		(pred_1 ?v3)
		(pred_5 ?v2)
		(pred_3 ?v2)
		(pred_2 ?v3 ?v2)
		(pred_6)
		(pred_4 ?v3))

   (:action op_3
       :parameters  (?v1 ?v5)
       :precondition (and (not-eq ?v1 ?v5) 
                          (pred_5 ?v1) (pred_5 ?v5) (pred_3 ?v1))
       :effect (and  (pred_3 ?v5)
		     (not (pred_3 ?v1))))


   (:action op_2
       :parameters (?v4 ?v8)
       :precondition  (and  (pred_1 ?v4) (pred_5 ?v8)
			    (pred_2 ?v4 ?v8) (pred_3 ?v8) (pred_6))
       :effect (and (pred_4 ?v4)
		    (not (pred_2 ?v4 ?v8)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v4  ?v8)
       :precondition  (and  (pred_1 ?v4) (pred_5 ?v8)
			    (pred_4 ?v4) (pred_3 ?v8))
       :effect (and (pred_2 ?v4 ?v8)
		    (pred_6)
		    (not (pred_4 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_01 obj_03 obj_05 
          obj_02 obj_04 obj_06 
)
(:init
(pred_5 obj_01)
(pred_5 obj_03)
(pred_5 obj_05)
(pred_1 obj_02)
(pred_1 obj_04)
(pred_1 obj_06)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(pred_6)
(pred_2 obj_02 obj_05)
(pred_2 obj_04 obj_01)
(pred_2 obj_06 obj_05)
(pred_3 obj_01)
)
(:goal
(and
(pred_2 obj_02 obj_01)
(pred_2 obj_04 obj_05)
(pred_2 obj_06 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_01) (pred_3 obj_03))
    (sometime-before  (pred_2 obj_04 obj_05) (pred_3 obj_03))
    (sometime-before  (pred_2 obj_06 obj_01) (pred_3 obj_03))
  )
)
)

; plan
1. (op_2 obj_04 obj_01)
   deleted: (pred_2 obj_04 obj_01) (pred_6)
   added: (pred_4 obj_04)
   goals met: 0 of 3
2. (op_3 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 0 of 3
3. (op_1 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_03) (pred_6)
   goals met: 0 of 3
4. (op_3 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 0 of 3
5. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06 obj_05) (pred_6)
   added: (pred_4 obj_06)
   goals met: 0 of 3
6. (op_3 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 0 of 3
7. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_2 obj_06 obj_01) (pred_6)
   goals met: 1 of 3
8. (op_3 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 1 of 3
9. (op_2 obj_02 obj_05)
   deleted: (pred_2 obj_02 obj_05) (pred_6)
   added: (pred_4 obj_02)
   goals met: 1 of 3
10. (op_3 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 1 of 3
11. (op_1 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_01) (pred_6)
   goals met: 2 of 3
12. (op_3 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 2 of 3
13. (op_2 obj_04 obj_03)
   deleted: (pred_2 obj_04 obj_03) (pred_6)
   added: (pred_4 obj_04)
   goals met: 2 of 3
14. (op_3 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 2 of 3
15. (op_1 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_05) (pred_6)
   goals met: 3 of 3
